Autodesk.Revit.DB.Visual.AssetPropertyType
Enumerated type listing the type of asset property
Asset Property Types.

Autodesk.Revit.DB.Visual.AssetPropertyType.Float3
Represents property Float array. The corresponding AssetProperty sub class is AssetPropertyFloatArray.

Autodesk.Revit.DB.Visual.AssetPropertyType.List
Represents property List. The corresponding AssetProperty sub class is AssetPropertyList.

Autodesk.Revit.DB.Visual.AssetPropertyType.ULonglong
Represents property unsigned Int64. The corresponding AssetProperty sub class is AssetPropertyUInt64.

Autodesk.Revit.DB.Visual.AssetPropertyType.Longlong
Represents property Int64. The corresponding AssetProperty sub class is AssetPropertyInt64.

Autodesk.Revit.DB.Visual.AssetPropertyType.Reference
Represents property Reference. The corresponding AssetProperty sub class is AssetPropertyReference.

Autodesk.Revit.DB.Visual.AssetPropertyType.Asset
Represents property Asset. The corresponding AssetProperty sub class is Asset.

Autodesk.Revit.DB.Visual.AssetPropertyType.Distance
Represents property Distance. The corresponding AssetProperty sub class is AssetPropertyDistance.
Special.

Autodesk.Revit.DB.Visual.AssetPropertyType.Time
Represents property Time. The corresponding AssetProperty sub class is AssetPropertyTime.

Autodesk.Revit.DB.Visual.AssetPropertyType.String
Represents property String. The corresponding AssetProperty sub class is AssetPropertyString.

Autodesk.Revit.DB.Visual.AssetPropertyType.Double44
Represents property 4x4 Double matrix. The corresponding AssetProperty sub class is AssetPropertyDoubleMatrix44.

Autodesk.Revit.DB.Visual.AssetPropertyType.Double4
Represents property 4d Double array. The corresponding AssetProperty sub class is AssetPropertyDoubleArray4d.

Autodesk.Revit.DB.Visual.AssetPropertyType.Double3
Represents property 3d Double array. The corresponding AssetProperty sub class is AssetPropertyDoubleArray3d.

Autodesk.Revit.DB.Visual.AssetPropertyType.Double2
Represents property 2d Double array. The corresponding AssetProperty sub class is AssetPropertyDoubleArray2d.

Autodesk.Revit.DB.Visual.AssetPropertyType.Double1
Represents property Double. The corresponding AssetProperty sub class is AssetPropertyDouble.

Autodesk.Revit.DB.Visual.AssetPropertyType.Float
Represents property Float. The corresponding AssetProperty sub class is AssetPropertyFloat.

Autodesk.Revit.DB.Visual.AssetPropertyType.Integer
Represents property Integer. The corresponding AssetProperty sub class is AssetPropertyInteger.

Autodesk.Revit.DB.Visual.AssetPropertyType.Enumeration
Represents property Enum. The corresponding AssetProperty sub class is AssetPropertyEnum.

Autodesk.Revit.DB.Visual.AssetPropertyType.Boolean
Represents property Boolean. The corresponding AssetProperty sub class is AssetPropertyBoolean.

Autodesk.Revit.DB.Visual.AssetPropertyType.Properties
Represents Properties. The corresponding AssetProperty sub class is AssetProperties.

Autodesk.Revit.DB.Visual.AssetPropertyType.Unknown
An unknown or unspecified property type.